tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf452_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF452_H_
#define _PIC18LF452_H_

#define PORTA                         0
#define AN0                           1
#define PORTA_RA0                     2
#define ULPWUIN                       3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define VREFM                         8
#define AN3                           9
#define PORTA_RA3                     10
#define VREFP                         11
#define PORTA_RA4                     12
#define T0CKI                         13
#define AN4                           14
#define PORTA_RA5                     15
#define LVDIN                         16
#define SS                            17
#define CLKO                          18
#define PORTA_RA6                     19
#define OSC2                          20
#define PORTB                         21
#define INT0                          22
#define PORTB_RB0                     23
#define INT1                          24
#define PORTB_RB1                     25
#define INT2                          26
#define PORTB_RB2                     27
#define CCP2A                         28
#define PORTB_CCP2                    29
#define CCP2_PA2                      30
#define PORTB_RB3                     31
#define PORTB_RB4                     32
#define PGM                           33
#define PORTB_RB5                     34
#define PGC                           35
#define PORTB_RB6                     36
#define PGD                           37
#define PORTB_RB7                     38
#define PORTC                         39
#define T1CKI                         40
#define T1OSO                         41
#define PORTC_RC0                     42
#define PORTC_CCP2                    43
#define T1OSI                         44
#define PA2                           45
#define PORTC_RC1                     46
#define CCP1                          47
#define PA1                           48
#define PORTC_RC2                     49
#define SCL                           50
#define SCK                           51
#define PORTC_RC3                     52
#define SDA                           53
#define SDI                           54
#define PORTC_RC4                     55
#define SDO                           56
#define PORTC_RC5                     57
#define TX                            58
#define CK                            59
#define PORTC_RC6                     60
#define DT                            61
#define RX                            62
#define PORTC_RC7                     63
#define PORTD                         64
#define PORTD_RD0                     65
#define PSP0                          66
#define PORTD_RD1                     67
#define PSP1                          68
#define PORTD_RD2                     69
#define PSP2                          70
#define PORTD_RD3                     71
#define PSP3                          72
#define PORTD_RD4                     73
#define PSP4                          74
#define PORTD_RD5                     75
#define PSP5                          76
#define PORTD_RD6                     77
#define PSP6                          78
#define PORTD_RD7                     79
#define SS2                           80
#define PSP7                          81
#define PORTE                         82
#define RDE                           83
#define PORTE_RD                      84
#define PD2                           85
#define AN5                           86
#define PORTE_RE0                     87
#define PORTE_WR                      88
#define WRE                           89
#define AN6                           90
#define PC2                           91
#define PORTE_RE1                     92
#define CCP10                         93
#define PB2                           94
#define PORTE_RE2                     95
#define AN7                           96
#define CS                            97
#define LATA                          98
#define LATA0                         99
#define LA0                           100
#define LATA1                         101
#define LA1                           102
#define LATA2                         103
#define LA2                           104
#define LATA3                         105
#define LA3                           106
#define LATA4                         107
#define LA4                           108
#define LATA5                         109
#define LA5                           110
#define LATA6                         111
#define LA6                           112
#define LATB                          113
#define LB0                           114
#define LATB0                         115
#define LB1                           116
#define LATB1                         117
#define LB2                           118
#define LATB2                         119
#define LB3                           120
#define LATB3                         121
#define LB4                           122
#define LATB4                         123
#define LB5                           124
#define LATB5                         125
#define LB6                           126
#define LATB6                         127
#define LB7                           128
#define LATB7                         129
#define LATC                          130
#define LATC0                         131
#define LC0                           132
#define LATC1                         133
#define LC1                           134
#define LATC2                         135
#define LC2                           136
#define LATC3                         137
#define LC3                           138
#define LATC4                         139
#define LC4                           140
#define LATC5                         141
#define LC5                           142
#define LATC6                         143
#define LC6                           144
#define LATC7                         145
#define LC7                           146
#define LATD                          147
#define LATD0                         148
#define LD0                           149
#define LATD1                         150
#define LD1                           151
#define LATD2                         152
#define LD2                           153
#define LATD3                         154
#define LD3                           155
#define LATD4                         156
#define LD4                           157
#define LATD5                         158
#define LD5                           159
#define LATD6                         160
#define LD6                           161
#define LATD7                         162
#define LD7                           163
#define LATE                          164
#define LATE0                         165
#define LE0                           166
#define LATE1                         167
#define LE1                           168
#define LATE2                         169
#define LE2                           170
#define TRISA                         171
#define TRISA_RA0                     172
#define TRISA0                        173
#define TRISA_RA1                     174
#define TRISA1                        175
#define TRISA2                        176
#define TRISA_RA2                     177
#define TRISA_RA3                     178
#define TRISA3                        179
#define TRISA_RA4                     180
#define TRISA4                        181
#define TRISA_RA5                     182
#define TRISA5                        183
#define TRISA_RA6                     184
#define TRISA6                        185
#define TRISB                         186
#define TRISB_RB0                     187
#define TRISB0                        188
#define TRISB_RB1                     189
#define TRISB1                        190
#define TRISB_RB2                     191
#define TRISB2                        192
#define TRISB_CCP2                    193
#define TRISB_RB3                     194
#define TRISB3                        195
#define TRISB_RB4                     196
#define TRISB4                        197
#define TRISB_RB5                     198
#define TRISB5                        199
#define TRISB_RB6                     200
#define TRISB6                        201
#define TRISB_RB7                     202
#define TRISB7                        203
#define TRISC                         204
#define TRISC0                        205
#define TRISC_RC0                     206
#define TRISC1                        207
#define TRISC_CCP2                    208
#define TRISC_RC1                     209
#define TRISC2                        210
#define TRISC_RC2                     211
#define TRISC3                        212
#define TRISC_RC3                     213
#define TRISC4                        214
#define TRISC_RC4                     215
#define TRISC5                        216
#define TRISC_RC5                     217
#define TRISC6                        218
#define TRISC_RC6                     219
#define TRISC7                        220
#define TRISC_RC7                     221
#define TRISD                         222
#define TRISD_RD0                     223
#define TRISD0                        224
#define TRISD_RD1                     225
#define TRISD1                        226
#define TRISD_RD2                     227
#define TRISD2                        228
#define TRISD_RD3                     229
#define TRISD3                        230
#define TRISD_RD4                     231
#define TRISD4                        232
#define TRISD_RD5                     233
#define TRISD5                        234
#define TRISD_RD6                     235
#define TRISD6                        236
#define TRISD_RD7                     237
#define TRISD7                        238
#define TRISE                         239
#define TRISE_RE0                     240
#define TRISE0                        241
#define TRISE_RE1                     242
#define TRISE1                        243
#define TRISE_RE2                     244
#define TRISE2                        245
#define PSPMODE                       246
#define IBOV                          247
#define OBF                           248
#define IBF                           249
#define PIE1                          250
#define TMR1IE                        251
#define TMR2IE                        252
#define CCP1IE                        253
#define SSPIE                         254
#define TXIE                          255
#define TX1IE                         256
#define RCIE                          257
#define RC1IE                         258
#define ADIE                          259
#define PSPIE                         260
#define PIR1                          261
#define TMR1IF                        262
#define TMR2IF                        263
#define CCP1IF                        264
#define SSPIF                         265
#define TXIF                          266
#define TX1IF                         267
#define RCIF                          268
#define RC1IF                         269
#define ADIF                          270
#define PSPIF                         271
#define IPR1                          272
#define TMR1IP                        273
#define TMR2IP                        274
#define CCP1IP                        275
#define SSPIP                         276
#define TX1IP                         277
#define TXIP                          278
#define RC1IP                         279
#define RCIP                          280
#define ADIP                          281
#define PSPIP                         282
#define PIE2                          283
#define CCP2IE                        284
#define TMR3IE                        285
#define LVDIE                         286
#define BCLIE                         287
#define EEIE                          288
#define PIR2                          289
#define CCP2IF                        290
#define TMR3IF                        291
#define LVDIF                         292
#define BCLIF                         293
#define EEIF                          294
#define IPR2                          295
#define CCP2IP                        296
#define TMR3IP                        297
#define LVDIP                         298
#define BCLIP                         299
#define EEIP                          300
#define EECON1                        301
#define EECON1_RD                     302
#define EECON1_WR                     303
#define WREN                          304
#define WRERR                         305
#define FREE                          306
#define CFGS                          307
#define EEFS                          308
#define EEPGD                         309
#define RCSTA                         310
#define RCD8                          311
#define RX9D                          312
#define OERR                          313
#define FERR                          314
#define ADDEN                         315
#define CREN                          316
#define SREN                          317
#define SRENA                         318
#define RC8_9                         319
#define RC9                           320
#define RX9                           321
#define nRC8                          322
#define NOT_RC8                       323
#define SPEN                          324
#define TXSTA                         325
#define TXD8                          326
#define TX9D1                         327
#define TX9D                          328
#define TRMT                          329
#define TRMT1                         330
#define BRGH1                         331
#define BRGH                          332
#define SYNC                          333
#define SYNC1                         334
#define TXEN1                         335
#define TXEN                          336
#define TX91                          337
#define TX8_9                         338
#define TX9                           339
#define NOT_TX8                       340
#define nTX8                          341
#define CSRC1                         342
#define CSRC                          343
#define T3CON                         344
#define TMR3ON                        345
#define TMR3CS                        346
#define nT3SYNC                       347
#define NOT_T3SYNC                    348
#define T3SYNC                        349
#define T3INSYNC                      350
#define SOSCEN3                       351
#define T3CCP1                        352
#define T3CKPS                        353
#define T3CKPS0                       354
#define T3CKPS1                       355
#define T3CCP2                        356
#define T3CON_RD16                    357
#define RD163                         358
#define T3RD16                        359
#define CCP2CON                       360
#define CCP2M                         361
#define CCP2M0                        362
#define CCP2M1                        363
#define CCP2M2                        364
#define CCP2M3                        365
#define DC2B0                         366
#define CCP2Y                         367
#define DC2B                          368
#define DC2B1                         369
#define DCCPX                         370
#define CCP2X                         371
#define CCP1CON                       372
#define CCP1M0                        373
#define CCP1M                         374
#define CCP1M1                        375
#define CCP1M2                        376
#define CCP1M3                        377
#define CCP1Y                         378
#define DC1B                          379
#define DC1B0                         380
#define CCP1X                         381
#define DC1B1                         382
#define ADCON1                        383
#define PCFG0                         384
#define PCFG                          385
#define PCFG1                         386
#define PCFG2                         387
#define CHSN3                         388
#define PCFG3                         389
#define ADCS2                         390
#define ADFM                          391
#define ADCON0                        392
#define ADON                          393
#define nDONE                         394
#define GO_nDONE                      395
#define GO_DONE                       396
#define NOT_DONE                      397
#define GODONE                        398
#define DONE                          399
#define GO                            400
#define GO_NOT_DONE                   401
#define CHS                           402
#define CHS0                          403
#define CHS1                          404
#define CHS2                          405
#define ADCS                          406
#define ADCS0                         407
#define ADCAL                         408
#define ADCS1                         409
#define SSPCON2                       410
#define SEN                           411
#define RSEN                          412
#define PEN                           413
#define RCEN                          414
#define ACKEN                         415
#define ACKDT                         416
#define ACKSTAT                       417
#define GCEN                          418
#define SSPCON1                       419
#define SSPM0                         420
#define SSPM                          421
#define SSPM1                         422
#define SSPM2                         423
#define SSPM3                         424
#define CKP                           425
#define SSPEN                         426
#define SSPOV                         427
#define WCOL                          428
#define SSPSTAT                       429
#define BF                            430
#define UA                            431
#define R_NOT_W                       432
#define READ_WRITE                    433
#define NOT_W                         434
#define R_W                           435
#define RW                            436
#define R                             437
#define NOT_WRITE                     438
#define nW                            439
#define nWRITE                        440
#define R_nW                          441
#define I2C_READ                      442
#define START                         443
#define S                             444
#define I2C_START                     445
#define STOP                          446
#define I2C_STOP                      447
#define P                             448
#define NOT_A                         449
#define I2C_DATA                      450
#define nA                            451
#define D_nA                          452
#define D                             453
#define DA                            454
#define DATA_ADDRESS                  455
#define D_A                           456
#define D_NOT_A                       457
#define NOT_ADDRESS                   458
#define nADDRESS                      459
#define I2C_DAT                       460
#define CKE                           461
#define SMP                           462
#define T2CON                         463
#define T2CKPS0                       464
#define T2CKPS                        465
#define T2CKPS1                       466
#define TMR2ON                        467
#define TOUTPS0                       468
#define TOUTPS                        469
#define TOUTPS1                       470
#define TOUTPS2                       471
#define TOUTPS3                       472
#define PR2                           473
#define WM0                           474
#define WM1                           475
#define WAIT0                         476
#define WAIT1                         477
#define EBDIS                         478
#define T1CON                         479
#define TMR1ON                        480
#define TMR1CS                        481
#define NOT_T1SYNC                    482
#define T1SYNC                        483
#define nT1SYNC                       484
#define T1INSYNC                      485
#define T1OSCEN                       486
#define SOSCEN                        487
#define T1CKPS0                       488
#define T1CKPS                        489
#define T1CKPS1                       490
#define T1RD16                        491
#define T1CON_RD16                    492
#define RCON                          493
#define BOR                           494
#define NOT_BOR                       495
#define nBOR                          496
#define POR                           497
#define nPOR                          498
#define NOT_POR                       499
#define nPD                           500
#define NOT_PD                        501
#define PD                            502
#define NOT_TO                        503
#define nTO                           504
#define TO                            505
#define nRI                           506
#define NOT_RI                        507
#define RI                            508
#define nIPEN                         509
#define IPEN                          510
#define NOT_IPEN                      511
#define WDTCON                        512
#define SWDTE                         513
#define SWDTEN                        514
#define LVDCON                        515
#define LVDL0                         516
#define LVDL                          517
#define LVDL1                         518
#define LVDL2                         519
#define LVDL3                         520
#define LVDEN                         521
